Repository: mohamedmaher-dev/commuter_driver
Catalog: lib/core/localization/l10n/intl_*.arb
Languages: ur

# current_language_value
source: English
ur: اردو

source: Welcome back
ur: واپس خوش آمدید

source: Sign in with your mail and password
ur: اپنے میل اور پاس ورڈ کے ساتھ سائن ان کریں

source: Forgot password
ur: پاس ورڈ بھول گئے

source: Sign in
ur: سائن ان

source: Create account
ur: اکاؤنٹ بنائیں

source: Mail
ur: میل

source: Password
ur: پاس ورڈ

# confrim_password
source: Confirm password
ur: پاس ورڈ کی تصدیق کریں

source: Welcom to Commuter
ur: کمیوٹر میں خوش آمدید

source: Name
ur: نام

source: Phone
ur: فون

source: Search
ur: تلاش کریں

source: Phone verification
ur: فون کی تصدیق

source: Enter OTP code here
ur: یہاں او ٹی پی کوڈ درج کریں

source: Seconds left
ur: سیکنڈ باقی

source: Resend OTP code
ur: او ٹی پی کوڈ دوبارہ بھیجیں

source: Already have an account
ur: پہلے سے ہی اکاؤنٹ موجود ہے

# app_name
source: Commuter
ur: کمیوٹر

source: Sign in with Google
ur: گوگل کے ساتھ سائن ان کریں

source: Please input your mail
ur: براہ کرم اپنا میل درج کریں

source: Confirm
ur: تصدیق کریں

source: You cannot leave the email empty
ur: آپ ای میل خالی نہیں چھوڑ سکتے

source: You cannot leave the password empty
ur: آپ پاس ورڈ خالی نہیں چھوڑ سکتے

source: Please write your email correctly
ur: براہ کرم اپنی ای میل درست لکھیں

source: The password must be greater than or equal to 6 characters
ur: پاس ورڈ 6 حروف یا اس سے زیادہ کا ہونا چاہیے

source: Warning
ur: انتباہ

source: Ok
ur: ٹھیک ہے

source: This account not active
ur: یہ اکاؤنٹ فعال نہیں ہے

source: Failure
ur: ناکامی

source: Timeout
ur: ٹائم آؤٹ

source: You cannot verify the code because timeout
ur: آپ کوڈ کی تصدیق نہیں کر سکتے کیونکہ ٹائم آؤٹ ہو گیا ہے

source: Verify code
ur: کوڈ کی تصدیق کریں

source: Change password
ur: پاس ورڈ تبدیل کریں

source: Please input your new password and confirm it
ur: براہ کرم اپنا نیا پاس ورڈ درج کریں اور اس کی تصدیق کریں

source: Passwords must match
ur: پاس ورڈ مماثل ہونا چاہیے

source: Name field must not be empty
ur: نام کا خانہ خالی نہیں ہونا چاہیے

source: Phone number not valid
ur: فون نمبر درست نہیں ہے

source: The password has been changed successfully
ur: پاس ورڈ کامیابی سے تبدیل کر دیا گیا ہے

source: No chats found
ur: کوئی چیٹ نہیں ملی

source: Enter your message
ur: اپنا پیغام درج کریں

source: Create contract
ur: معاہدہ بنائیں

source: Total price
ur: کل قیمت

source: Number of months
ur: مہینوں کی تعداد

# no_messages_yet
source: No messages yet , start a conversation
ur: ابھی تک کوئی پیغام نہیں، گفتگو شروع کریں

source: Allow permissions
ur: اجازت دیں

source: Whare to go?
ur: کہاں جانا ہے؟

source: Nearby commuters
ur: قریبی مسافر

source: Transactions
ur: لین دین

source: Chats
ur: چیٹس

source: Profile
ur: پروفائل

source: Unknown
ur: نامعلوم

source: Commute Name
ur: سفر کا نام

source: Not selected
ur: منتخب نہیں کیا گیا

source: Location
ur: مقام

source: Add commute
ur: سفر شامل کریں

source: Location of the trip
ur: سفر کی جگہ

source: Date of the trip
ur: سفر کی تاریخ

source: Add schedules trip
ur: شیڈول شدہ سفر شامل کریں

source: Pin
ur: پن

source: Unpin
ur: پن ہٹائیں

source: Delete
ur: حذف کریں

source: Commuter name
ur: مسافر کا نام

source: My commutes
ur: میرے سفر

source: Commutes
ur: سفر

source: Schedules trips
ur: شیڈول شدہ سفر

# no_commutes_found
source: No commutes found, Please add one
ur: کوئی سفر نہیں ملا، براہ کرم ایک شامل کریں

source: Filter by
ur: فلٹر کریں

source: Choose your preference
ur: اپنی ترجیح منتخب کریں

source: Best match
ur: بہترین مطابقت

source: Carpooling
ur: کارپولنگ

source: Female only
ur: صرف خواتین

source: One way
ur: ایک طرفہ

source: Two way
ur: دو طرفہ

source: All
ur: سب

source: Online
ur: آن لائن

source: Upcoming
ur: آنے والا

source: Offline
ur: آف لائن

source: Notifications
ur: اطلاعات

source: Read
ur: پڑھیں

source: Readed
ur: پڑھا گیا

source: New notifications
ur: نئی اطلاعات

source: No notifications
ur: کوئی اطلاع نہیں

source: My location
ur: میرا مقام

source: Country
ur: ملک

source: Street
ur: گلی

source: Not available
ur: دستیاب نہیں

source: Edit
ur: ترمیم کریں

source: Enter text
ur: متن درج کریں

# choose_your_picture
source: Choose you picture
ur: اپنی تصویر منتخب کریں

source: From gallery
ur: گیلری سے

source: From camera
ur: کیمرہ سے

source: Sign out
ur: سائن آؤٹ

source: Failure to update profile
ur: پروفائل اپ ڈیٹ کرنے میں ناکامی

source: Please select an image
ur: براہ کرم ایک تصویر منتخب کریں

source: Update profile
ur: پروفائل اپ ڈیٹ کریں

source: General
ur: عام

source: Night mode
ur: نائٹ موڈ

source: Current language
ur: موجودہ زبان

source: My profile
ur: میرا پروفائل

source: Delete my profile
ur: میرا پروفائل حذف کریں

source: Are you sure you want to delete the profile?
ur: کیا آپ واقعی پروفائل حذف کرنا چاہتے ہیں؟

source: Settings
ur: ترتیبات

source: Contract number
ur: معاہدہ نمبر

source: Contract date
ur: معاہدہ کی تاریخ

source: Commute ID
ur: سفر کی شناخت

source: Commute location
ur: سفر کا مقام

source: Wallet
ur: والیٹ

source: Contracts
ur: معاہدے

source: Current balance
ur: موجودہ بیلنس

source: Balance used
ur: استعمال شدہ بیلنس

source: Enter amount
ur: رقم درج کریں

source: Charge
ur: چارج کریں

source: Charge balance
ur: بیلنس چارج کریں

source: Transaction history
ur: لین دین کی تاریخ

source: Added to balance
ur: بیلنس میں شامل کیا گیا

source: Send request
ur: درخواست بھیجیں

source: Nearest station
ur: قریب ترین اسٹیشن

source: Send ride request
ur: سواری کی درخواست بھیجیں

source: Cancel
ur: منسوخ کریں

source: Enter location
ur: مقام درج کریں

source: Search for place
ur: مقام تلاش کریں

source: Set on map
ur: نقشے پر مقرر کریں

source: Current location
ur: موجودہ مقام

source: Where to?
ur: کہاں جانا ہے؟

source: Enter pickup location
ur: پک اپ مقام درج کریں

source: Enter landing location
ur: اتارنے کا مقام درج کریں

source: Success
ur: کامیابی

source: Send ride request success
ur: سواری کی درخواست کامیاب

source: Send ride request failure
ur: سواری کی درخواست ناکام

source: Join commute
ur: سفر میں شامل ہوں

source: Pickup
ur: پک اپ

source: Dropoff
ur: اتارنا

source: Pickup and dropoff
ur: پک اپ اور اتارنا

source: Matching
ur: مماثلت

source: Car brand - Model
ur: کار برانڈ - ماڈل

source: Time left
ur: باقی وقت

# no_nearby_commuters_right_now_try_again_later
source: No nearby commuters right now, please try again later
ur: ابھی کوئی قریبی مسافر نہیں، بعد میں کوشش کریں

source: Joined commute successfully
ur: سفر میں کامیابی سے شامل ہو گئے

source: No schedules trips found, please add one
ur: کوئی شیڈول شدہ سفر نہیں ملا، براہ کرم ایک شامل کریں

source: Round trip
ur: راؤنڈ ٹرپ

source: Start time
ur: آغاز کا وقت

source: End time
ur: اختتام کا وقت

source: Please fill all fields
ur: براہ کرم تمام خانے بھریں

source: Range
ur: حد

source: Commute deleted successfully
ur: سفر کامیابی سے حذف کر دیا گیا

source: Commute
ur: سفر

source: Approved join
ur: منظور شدہ شمولیت

source: Requests
ur: درخواستیں

source: No approved requests
ur: کوئی منظور شدہ درخواستیں نہیں

source: You online
ur: آپ آن لائن ہیں

source: Go online
ur: آن لائن جائیں

source: Home
ur: ہوم

source: Scheduled trips
ur: شیڈول شدہ سفر

source: Please verify your account
ur: براہ کرم اپنے اکاؤنٹ کی تصدیق کریں
